In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
empdf = pd.read_csv("Empexport.csv")

In [5]:
empdf.columns = (['employee_id','first_name','last_name','job_id','salary',
                 'commission_pct','manager_id','department_id'])

In [6]:
empdf

,employee_id,first_name,last_name,job_id,salary,commission_pct,manager_id,department_id
0,101,Neena,Kochhar,AD_VP,17000,Null,100,90
1,102,Lex,De Haan,AD_VP,17000,Null,100,90
2,103,Alexander,Hunold,IT_PROG,9000,Null,102,60
3,104,Bruce,Ernst,IT_PROG,6000,Null,103,60
4,105,David,Austin,IT_PROG,4800,Null,103,60
...,...,...,...,...,...,...,...,...
101,202,Pat,Fay,MK_REP,6000,Null,201,20
102,203,Susan,Mavris,HR_REP,6500,Null,101,40
103,204,Hermann,Baer,PR_REP,10000,Null,101,70
104,205,Shelley,Higgins,AC_MGR,12008,Null,101,110
105,206,William,Gietz,AC_ACCOUNT,8300,Null,205,110

# Take a Quick Glimpse of Data in Dataframe

In [7]:
empdf.head()         # First 5 rows from df

,employee_id,first_name,last_name,job_id,salary,commission_pct,manager_id,department_id
0,101,Neena,Kochhar,AD_VP,17000,Null,100,90
1,102,Lex,De Haan,AD_VP,17000,Null,100,90
2,103,Alexander,Hunold,IT_PROG,9000,Null,102,60
3,104,Bruce,Ernst,IT_PROG,6000,Null,103,60
4,105,David,Austin,IT_PROG,4800,Null,103,60

In [8]:
empdf.head(10)         # First 10 rows from df

,employee_id,first_name,last_name,job_id,salary,commission_pct,manager_id,department_id
0,101,Neena,Kochhar,AD_VP,17000,Null,100,90
1,102,Lex,De Haan,AD_VP,17000,Null,100,90
2,103,Alexander,Hunold,IT_PROG,9000,Null,102,60
3,104,Bruce,Ernst,IT_PROG,6000,Null,103,60
4,105,David,Austin,IT_PROG,4800,Null,103,60
5,106,Valli,Pataballa,IT_PROG,4800,Null,103,60
6,107,Diana,Lorentz,IT_PROG,4200,Null,103,60
7,108,Nancy,Greenberg,FI_MGR,12008,Null,101,100
8,109,Daniel,Faviet,FI_ACCOUNT,9000,Null,108,100
9,110,John,Chen,FI_ACCOUNT,8200,Null,108,100

In [9]:
empdf.tail()         # Last 5 rows from df

,employee_id,first_name,last_name,job_id,salary,commission_pct,manager_id,department_id
101,202,Pat,Fay,MK_REP,6000,Null,201,20
102,203,Susan,Mavris,HR_REP,6500,Null,101,40
103,204,Hermann,Baer,PR_REP,10000,Null,101,70
104,205,Shelley,Higgins,AC_MGR,12008,Null,101,110
105,206,William,Gietz,AC_ACCOUNT,8300,Null,205,110

In [10]:
empdf.tail(10)         # Last 10 rows from df

,employee_id,first_name,last_name,job_id,salary,commission_pct,manager_id,department_id
96,197,Kevin,Feeney,SH_CLERK,3000,Null,124,50
97,198,Donald,OConnell,SH_CLERK,2600,Null,124,50
98,199,Douglas,Grant,SH_CLERK,2600,Null,124,50
99,200,Jennifer,Whalen,AD_ASST,4400,Null,101,10
100,201,Michael,Hartstein,MK_MAN,13000,Null,100,20
101,202,Pat,Fay,MK_REP,6000,Null,201,20
102,203,Susan,Mavris,HR_REP,6500,Null,101,40
103,204,Hermann,Baer,PR_REP,10000,Null,101,70
104,205,Shelley,Higgins,AC_MGR,12008,Null,101,110
105,206,William,Gietz,AC_ACCOUNT,8300,Null,205,110

In [11]:
len(empdf)            # number of rows in df

106

In [12]:
empdf.columns         # list of column labels

Index(['employee_id', 'first_name', 'last_name', 'job_id', 'salary',
       'commission_pct', 'manager_id', 'department_id'],
      dtype='object')

In [13]:
len(empdf.columns)     # number of columns in df

8

# Structural Details

In [14]:
empdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employee_id     106 non-null    int64
 1   first_name      106 non-null    object
 2   last_name       106 non-null    object
 3   job_id          106 non-null    object
 4   salary          106 non-null    int64
 5   commission_pct  106 non-null    object
 6   manager_id      106 non-null    int64
 7   department_id   106 non-null    object
dtypes: int64(3), object(5)
memory usage: 6.8+ KB

In [15]:
empdf.describe()

       employee_id        salary  manager_id
count   106.000000    106.000000  106.000000
mean    153.500000   6296.377358  124.764151
std      30.743563   3531.762189   20.315395
min     101.000000   2100.000000  100.000000
25%     127.250000   3100.000000  108.000000
50%     153.500000   6150.000000  122.000000
75%     179.750000   8750.000000  145.000000
max     206.000000  17000.000000  205.000000

# Dataframe Slicing

In [ ]:
"""
dataframe[rowSlice][colSlice]

rowSlice       start:stop:step

colSlice       [col_list]       [ [col1,col2,col3....] ]
"""

In [ ]:
empdf[10:100:10]

In [ ]:
empdf[::-1]

In [ ]:
empdf[0:-1]              # all rows except last

In [ ]:
empdf[10:100:10][['employee_id','last_name','salary']]

In [ ]:
empdf.head()

In [ ]:
empdf.head()

In [ ]:
empdf.describe()

In [ ]:
empdf.job_id

In [ ]:
empdf["job_id"]

In [ ]:
empdf.job_id.unique()

In [ ]:
empdf["job_id"].unique()

# Filtering the Dataframe

In [ ]:
# display all employees with salary more than 10000

empdf[________][['employee_id','first_name','salary']]

In [ ]:
empdf[_________]

In [ ]:
"""
and    => &   or  => |
"""

In [ ]:
empdf[ (empdf.salary < 5000) & (empdf.department_id  == '50')]

In [ ]:
condition1 = (empdf.manager_id == '100')
condition2 = (empdf.job_id == 'PU_CLERK')

empdf[____ | _____]

In [ ]:
# display employees with job_id SA_REP, PU_CLERK, IT_PROG, MK_MAN

empdf[empdf.job_id.____( ['SA_REP', 'PU_CLERK', 'IT_PROG', 'MK_MAN'] )]

In [ ]:
empdf[empdf.job_id.____.____("CLERK")]

In [ ]:
empdf[empdf.last_name._____.____("A")]

In [ ]:
empdf[empdf.department_id=='50'].head()

In [ ]:
empdf[empdf.department_id=='50'].describe()[['salary']]

# Sorting of DF

In [ ]:
empdf.sort_values(by='salary',ascending=False)

# Grouping of DF

In [ ]:
gResult = empdf.groupby()

# Type Casting Columns

In [ ]:
empdf.info()

In [ ]:
def convertInt(x):
    if x == 'Null':
        return 0
    else:
        return int(x)

In [ ]:
def convertFloat(x):
    if x == 'Null':
        return 0.0
    else:
        return float(x)

In [ ]:
empdf.department_id = empdf.department_id.apply(_____)
empdf.manager_id = empdf.manager_id.apply(_____)
empdf.commission_pct = empdf.commission_pct.apply(____)

In [ ]:
empdf.info()

In [ ]:
empdf.describe()

# Dataframe Manipulations

In [ ]:
empdfCp = empdf[10:100:10][['employee_id','last_name','salary']]

In [ ]:
empdfCp['annualSal'] = empdfCp.salary*12

In [ ]:
empdfCp

In [ ]:
empdfCp.drop(____________)

In [ ]:
empdfCp

In [ ]:
empdfCp.drop(_____________)   # Drop rows default axis=0

In [ ]:
empdfCp

# Access DF with index

### iloc[rowIndex, colIndex]

### iloc[rowIndex, colIndex].values  returns numpy array

In [ ]:
"""
if colIndex is mentioned using : or [] then we get a 2d numpy array
if colIndex is mentioned as a single integer then we get a 1d numpy array

"""

In [ ]:
empdf.iloc[0:10,0:5].values    # 2d numpy array   10 rows 5 columns

In [ ]:
empdf.iloc[0:10,[2,4,6,7]].values   # 2d numpy array  10 rows 4 column

In [ ]:
empdf.iloc[0:10,[4]].values   # 2d numpy array   10 rows  1 column

In [ ]:
empdf.iloc[0:10, 0:-1].values   # 2d numpy array  all rows except last

In [ ]:
empdf.iloc[0:10, 7].values      # 1d numpy array with 10 values

# Save the DF output into a File

In [ ]:
empdf.to_csv("CleanedDF.csv", header=True,index=True)

In [ ]:
empdf.to_csv("CleanedDF2.csv", header=True,index=False)

In [ ]:
empdf.describe().to_csv("EmpReport.csv", header=True,index=True)